app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM "articles"

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 683130438)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 980190963)

  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("created_at", "byline", "author", "body", "updated_at", "headline", "rel_date") VALUES('2010-04-25 15:02:22', 'wassip', 'something', 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean molestie est a eros aliquet in lacinia purus venenatis. Nulla semper orci sed enim consectetur mollis. Nam vitae enim nec sapien blandit tempus ac nec neque. Vivamus eu leo metus. Aenean justo turpis, cursus vel volutpat in, sollicitudin in tortor. Fusce tincidunt euismod turpis. Morbi vel aliquam velit. Duis ornare mauris dictum neque hendrerit mattis. Maecenas quis ullamcorper quam. Etiam eget sem dui, sed posuere neque. Morbi volutpat nisl eget lectus ultricies ullamcorper. Donec at dolor nisi. Nunc quis dapibus nunc. Proin dictum aliquam purus in volutpat. Curabitur eget urna sit. ', '2010-04-25 15:02:22', 'testing validations', '2010-04-25 15:01:00')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 980190963)
UPDATE "articles" SET "updated_at" = '2010-04-25 15:06:55', "body" = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit. Aenean molestie est a eros aliquet in lacinia purus venenatis. Nulla semper orci sed enim consectetur mollis. Nam vitae enim nec sapien blandit tempus ac nec neque. Vivamus eu leo metus. Aenean justo turpis, cursus vel volutpat in, sollicitudin in tortor.<img src="rails.png"> Fusce tincidunt euismod turpis. Morbi vel aliquam velit. Duis ornare mauris dictum neque hendrerit mattis. Maecenas quis ullamcorper quam. Etiam eget sem dui, sed posuere neque. Morbi volutpat nisl eget lectus ultricies ullamcorper. Donec at dolor nisi. Nunc quis dapibus nunc. Proin dictum aliquam purus in volutpat. Curabitur eget urna sit. ' WHERE "id" = 980190963